In [1]:
import pandas as pd
import numpy as np

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression
import seaborn as sns

In [2]:
df = pd.read_csv("C:/Users/NIKUNJ KIKANI/Desktop/machine learning/Learning Folder/pipeline/Book2.csv")[['Age','Pclass','SibSp','Parch','Survived']]

In [3]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [4]:
df.isnull().mean()*100

Age         19.86532
Pclass       0.00000
SibSp        0.00000
Parch        0.00000
Survived     0.00000
dtype: float64

In [5]:
df.dropna(inplace=True)

In [6]:
x = df.drop(['Survived'],axis=1)
y = df['Survived']

In [7]:
x.sample(7)

      Age  Pclass  SibSp  Parch
323  22.0       2      1      1
122  32.5       2      1      0
175  18.0       3      1      1
858  24.0       3      0      3
607  27.0       1      0      0
690  31.0       1      1      0
779  43.0       1      0      1

In [8]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring='accuracy',cv=20))

0.6933333333333332

# Applying Feature Construction

In [9]:
x['Family_size'] = x['SibSp'] + x['Parch'] + 1

In [10]:
x.sample(6)

      Age  Pclass  SibSp  Parch  Family_size
556  48.0       1      1      0            2
345  24.0       2      0      0            1
842  30.0       1      0      0            1
487  58.0       1      0      0            1
297   2.0       1      1      2            4
865  42.0       2      0      0            1

In [11]:
def myfunc(num):
    if num == 1 :
#          alone
        return 0 
    elif num > 1 and num <=4:
#         small family
        return 1
    else : 
#         big family
        return 2

In [12]:
myfunc(4)

1

In [13]:
x['Family_type'] = x['Family_size'].apply(myfunc)

In [14]:
x.sample(6)

      Age  Pclass  SibSp  Parch  Family_size  Family_type
668  43.0       3      0      0            1            0
314  43.0       2      1      1            3            1
172   1.0       3      1      1            3            1
112  22.0       3      0      0            1            0
769  32.0       3      0      0            1            0
68   17.0       3      4      2            7            2

In [15]:
x.drop(['SibSp','Parch','Family_size'],inplace=True,axis=1)

In [16]:
x.sample(5)

      Age  Pclass  Family_type
840  20.0       3            0
870  26.0       3            0
197  42.0       3            1
818  43.0       3            0
380  42.0       1            0

In [17]:
np.mean(cross_val_score(LogisticRegression(),x,y,scoring='accuracy',cv=20))

0.7003174603174602

In [18]:
# before Feature Construction = 0.6933333333333332
# after  Feature Construction = 0.7003174603174602

# Feature Splitting

In [19]:
df1 = pd.read_csv("C:/Users/NIKUNJ KIKANI/Desktop/machine learning/Learning Folder/pipeline/Book2.csv")

In [20]:
df1.shape

(891, 13)

In [21]:
df1.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Unnamed: 12
562,563,0,2,"Norman, Mr. Robert Douglas",male,28.0,0,0,218629,13.5000,NaN,S,NaN
723,724,0,2,"Hodges, Mr. Henry Price",male,50.0,0,0,250643,13.0000,NaN,S,NaN
412,413,1,1,"Minahan, Miss. Daisy E",female,33.0,1,0,19928,90.0000,C78,Q,NaN
519,520,0,3,"Pavlovic, Mr. Stefo",male,32.0,0,0,349242,7.8958,NaN,S,NaN
415,416,0,3,"Meek, Mrs. Thomas (Annie Louise Rowley)",female,NaN,0,0,343095,8.0500,NaN,S,NaN

In [22]:
df1.drop(['Unnamed: 12'],axis=1,inplace=True)

In [23]:
df1['Name'].head(10)

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [24]:
df1['Title'] = df1['Name'].str.split(',',expand=True)[1].str.split('.',expand=True)[0]

In [25]:
df1['Name'].str.split(',',expand=True)

             0                                            1
0       Braund                              Mr. Owen Harris
1      Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2    Heikkinen                                  Miss. Laina
3     Futrelle           Mrs. Jacques Heath (Lily May Peel)
4        Allen                            Mr. William Henry
..         ...                                          ...
886   Montvila                                  Rev. Juozas
887     Graham                         Miss. Margaret Edith
888   Johnston               Miss. Catherine Helen "Carrie"
889       Behr                              Mr. Karl Howell
890     Dooley                                  Mr. Patrick

[891 rows x 2 columns]

In [26]:
df1[['Title','Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [27]:
(df1.groupby('Title').mean()['Survived']).sort_values(ascending=False)

Title
 the Countess    1.000000
 Mlle            1.000000
 Sir             1.000000
 Ms              1.000000
 Lady            1.000000
 Mme             1.000000
 Mrs             0.792000
 Miss            0.697802
 Master          0.575000
 Col             0.500000
 Major           0.500000
 Dr              0.428571
 Mr              0.156673
 Jonkheer        0.000000
 Rev             0.000000
 Don             0.000000
 Capt            0.000000
Name: Survived, dtype: float64

In [28]:
df1['Is_Married'] = 0
df1['Is_Married'].loc[df1['Title'] == 'Mrs'] = 1

C:\Users\NIKUNJ KIKANI\AppData\Local\Temp\ipykernel_4200\3636290223.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['Is_Married'].loc[df1['Title'] == 'Mrs'] = 1

In [33]:
df1['Is_Married'].sample(5)

408    0
60     0
145    0
461    0
25     0
Name: Is_Married, dtype: int64